# 演習 5-14 平方根を求める値の端末からの入力
# p5-6.py を改造して端末から平方根を求める数値を入力するようにしなさい.p5-
# 6.py もしくは p5-7.py を開き，File メニューの SaveAs で ex3_3.py として保存 したうえで改造すること.

# x の平方根を求める（制度を指定した平方根の計算）
x = 2
#
rnew = float(input("平方根を求める数 "))
#
diff = rnew - x / rnew
if diff < 0:
    diff = -diff
while (diff > 1.0E-6):
    r1 = rnew
    r2 = x / r1
    rnew = (r1 + r2) / 2
    print(r1, rnew, r2)
    diff = r1 - r2
    if diff < 0:
        diff = -diff

# 出力結果
# 平方根を求める数 3
# 3.0 1.8333333333333333 0.6666666666666666
# 1.8333333333333333 1.4621212121212122 1.090909090909091
# 1.4621212121212122 1.414998429894803 1.3678756476683938
# 1.414998429894803 1.4142137800471977 1.413429130199592
# 1.4142137800471977 1.4142135623731118 1.414213344699026